test/artillery/proxy.yml
config:
  target: "http://localhost:3000"
  http: 
    pool: 10
  processor: "./randomGenerator.js"
  phases:
    - duration: 60
      arrivalRate: 1000
scenarios:
  - name: "Getting song and comments"
    flow:
      - function: "generateSongId"
      - get:
          url: "/{{songId}}/"
  - name: "Posting song to database"
    flow:
      - function: "generateSong"
      - post: 
          url: "/api/musicplayer"
          json: 
            title: "{{title}}"
            artist_id: "{{artist_id}}"
            hashtag: "{{hashtag}}"
            time_elapsed: "{{time_elapsed}}"
            start_time: "{{start_time}}"
            song_length: "{{song_length}}"
            decibel: "{{decibel}}"
            song_image: "{{song_image}}"
            song_url: "{{song_url}}"